<script
    setup
    lang="ts"
>
const props = defineProps<{
  documentationKey: string,
}>()
</script>

<template>
  <template v-if="documentationKey === 'available-transformation-materials'">
    <ul>
      <li>
        <p class="font-bold text-xl">Доступные материалы для изготовления</p>
      </li>
    </ul>

    <n-divider/>
    <div class="flex flex-col gap-4">
      <p>Список отображает материалы, которые могут быть использованы для изготовления в конкретной операции. В
        некоторых операциях изначально отображается не весь материал, список может быть дополнен после выбора первого
        материала.</p>
      <p> Например: при изготовлении углового шпунта с замком доступные угловые элементы появятся только после выбора
        шпунта, так как марка и параметры углового элемента зависят от выбранного шпунта</p>
      <n-alert
          title="Замечание"
          type="default"
      >
        <p class="italic text-sm text-gray-500">В период тестирования в списке может отображаться лишний материал. Часть
          будет недоступна для выбора. Если обнаружили возможность выбора материала не соответствующего операции,
          отметьте это в результате тестирования</p>
      </n-alert>
      <p class="font-bold text-lg">Выбор материала:</p>

      <p>Выбор материала осуществляется путем деления материала</p>

      <p><span class="font-bold">Вариант 1:</span> Нажмите <span class="font-bold">левой кнопкой мыши</span> на материал
        для открытия окна параметров
        разделения материала</p>
      <p><span class="font-bold">Вариант 2:</span> Нажмите <span class="font-bold">правой кнопкой мыши</span> на
        материал для открытия меню
        дополнительных действий и выберите пункт
        <span class="font-bold">"Разделить"</span></p>
      <p><span class="font-bold">Вариант 3:</span> Для некоторых операций доступен быстрый выбор материала. Для этого
        <span class="font-bold">дважды</span> кликните <span class="font-bold">левой кнопкой мыши</span> на материал.
        Результатом будет будет добавление одной единицы материала в список выбранных материалов.</p>

      <p class="font-bold text-lg">Отображение измененных материалов:</p>
      <p>Карточки материалов, которые были выбраны в рамках текущей операции отображаются </p>
    </div>
  </template>
</template>

<style scoped>

</style>